import math

x1 = float(input("Введіть координату x точки A: "))
y1 = float(input("Введіть координату y точки A: "))

x2 = float(input("Введіть координату x точки B: "))
y2 = float(input("Введіть координату y точки B: "))

dA = math.sqrt(x1**2 + y1**2)
dB = math.sqrt(x2**2 + y2**2)

if dA < dB:
    print("Точка A знаходиться ближче до початку координат")
elif dB < dA:
    print("Точка B знаходиться ближче до початку координат")
else:
    print("Точка A і точка B знаходяться на однаковій відстані до початку координат")