x = float(input("Введіть координату x точки А: "))
y = float(input("Введіть координату y точки А: "))

if x == 0 and y == 0:
    print("Точка А знаходиться в початку координат (0, 0)")
elif x == 0:
    print("Точка А знаходиться на осі OY")
elif y == 0:
    print("Точка А знаходиться на осі OX")
else:
    if x > 0 and y > 0:
        print("Точка А знаходиться в першому координатному куті (I)")
    elif x < 0 < y:
        print("Точка А знаходиться в другому координатному куті (II)")
    elif x < 0 and y < 0:
        print("Точка А знаходиться в третьому координатному куті (III)")
    elif x > 0 > y:
        print("Точка А знаходиться в четвертому координатному куті (IV)")